Trash = Submenu.add_static_submenu('Другое', 'HC_Stuff_Trash')
HOME_SUBMENU:add_sub_option('Другое', 'HC_Stuff_Trash', Trash):setHint('Юзлесс хуета для прикола.')

--- Вызвать хренча --------------------------------------------------

Trash:add_click_option('Вызвать Хренча', 'HC_Stuff_Trash_Gooch', function ()
    script_global:new(2698947):at(3 + 1):set_int64(171)
    script_global:new(2698947):at(2):set_int64(6)
    notify.success('Stuff', 'Хренч вызван')
end)

--- Премиальные транспорт -------------------------------------------

Trash:add_click_option('Получить премиальный транспорт', 'HC_Stuff_TDMasks', function ()
    player_index = script_global:new(1574915):get_int64()
    stat1 = 'MP'..player_index..'_CARMEET_PV_CHLLGE_CMPLT'
    stat2 = 'MP'..player_index..'_CARMEET_PV_CLMED'
    hash1 = string.smart_joaat(stat1)
    hash2 = string.smart_joaat(stat2)
    stats.set_bool(hash1, true)
    stats.set_bool(hash2, false)
    notify.success('Stuff', 'Машина получена')
end):setHint('Транспорт за испытание в автоклубе ЛС.')

--- Телепортироваться к оружейному фургону --------------------------

Trash:add_click_option('Телепортироваться к оружейному фургону', 'HC_Stuff_GV', function ()
    gunvan_locs = {
        [0] = {-29.532, 6435.136, 31.162},
        [1] = {1705.214, 4819.167, 41.75},
        [2] = {1795.522, 3899.753, 33.869},
        [3] = {1335.536, 2758.746, 51.099},
        [4] = {795.583, 1210.78, 338.962},
        [5] = {-3192.67, 1077.205, 20.594},
        [6] = {-789.719, 5400.921, 33.915},
        [7] = {-24.384, 3048.167, 40.703},
        [8] = {2666.786, 1469.324, 24.237},
        [9] = {-1454.966, 2667.503, 3.2},
        [10] = {2340.418, 3054.188, 47.888},
        [11] = {1509.183, -2146.795, 76.853},
        [12] = {1137.404, -1358.654, 34.322},
        [13] = {-57.208, -2658.793, 5.737},
        [14] = {1905.017, 565.222, 175.558},
        [15] = {974.484, -1718.798, 30.296},
        [16] = {779.077, -3266.297, 5.719},
        [17] = {-587.728, -1637.208, 19.611},
        [18] = {733.99, -736.803, 26.165},
        [19] = {-1694.632, -454.082, 40.712},
        [20] = {-1330.726, -1163.948, 4.313},
        [21] = {-496.618, 40.231, 52.316},
        [22] = {275.527, 66.509, 94.108},
        [23] = {260.928, -763.35, 30.559},
        [24] = {-478.025, -741.45, 30.299},
        [25] = {894.94, 3603.911, 32.56},
        [26] = {-2166.511, 4289.503, 48.733},
        [27] = {1465.633, 6553.67, 13.771},
        [28] = {1101.032, -335.172, 66.944},
        [29] = {149.683, -1655.674, 29.028}
    }
    location = script_global:new(2652572 + 2650 + 1):get_int64()
    utils.teleport(gunvan_locs[location][1], gunvan_locs[location][2], gunvan_locs[location][3])
    notify.success('Stuff', 'Телепортирован')
end)